{
  "events": [
    {
      "title": "Detention W/ DJ Naeem",
      "date": "2027-02-07",
      "time": "5:00 PM",
      "location": "Sid's Bar",
      "link": "https://dice.fm/event/ryn82v-detention-w-dj-naeem-7th-feb-sid-the-cat-auditorium-south-pasadena-tickets",
      "description": "Detention W/ DJ Naeem Sid's Bar Sat, Feb 7, 5:00 PM Gigs Pasadena Free The price you'll pay. No surprises later. Buy now Got a code? About Sid The Cat Presents DETENTION BAD MUSIC HAS NEVER SOUNDED SO GOOD. POST PUNK, INDY SLEEZE, SOPHISTI-POP, & RAP SELECTED BY NAEEM at Sid's Bar 7pm - Close This is an All Ages event. Presented by Sid The Cat Auditorium. Lineup Sid The Cat DJs Venue Sid The Cat Auditorium 1022 El Centro Street, South Pasadena, California 91030, United States Open in maps Follow Doors open 5:00 PM FAQs Can I buy tickets in person? If the show has not sold out in advance, you can purchase tickets at the door during the event. Where are you located? We are located at 1022 El Centro St. South Pasadena, CA 91030 in the heart of Downtown South Pas. Enter the venue on Fairview S",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Dylan Meek",
      "date": "2027-02-07",
      "time": "6:00 PM",
      "location": "Sid The Cat Auditorium",
      "link": "https://dice.fm/event/wwrd5p-dylan-meek-7th-feb-sid-the-cat-auditorium-south-pasadena-tickets",
      "description": "Dylan Meek Sid The Cat Auditorium Sat, Feb 7, 6:00 PM Gigs Pasadena Selling fast Free The price you'll pay. No surprises later. Buy now Got a code? About Dylan Meek A seventh generation Texan, from a family of glass artists, literature professors, psychologists, and rocket engineers, Dylan was raised in Wimberley, TX. At 14, Harlem piano master Jimmy Neeley took him in as a protege, passing along nearly a century of w Read more Posted by DICE Event information Sid The Cat Presents Dylan Meek with Sam Broido 2/7/26 at Sid The Cat Auditorium Come enjoy Dylan Meek preforming at Sid The Cat Auditorium! Part of the South Pasadena Art's Crawl! Free with RSVP This is an All Ages event Presented by Sid The Cat Auditorium. Lineup Dylan Meek Follow Sam Broido Venue Sid The Cat Auditorium 1022 El Cen",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Louie Lopez Pro 2 Afterparty with Start Today, Suedo Youth",
      "date": "2027-02-07",
      "time": "7:00 PM",
      "location": "Oblivion",
      "link": "https://dice.fm/event/yoa2ax-louie-lopez-pro-2-afterparty-with-start-today-suedo-youth-7th-feb-oblivion-los-angeles-tickets",
      "description": "Louie Lopez Pro 2 Afterparty with Start Today, Suedo Youth Oblivion Sat, Feb 7, 7:00 PM Gigs Highland Park Off Sale Got a code? About Converse Presents Louie Lopez Pro 2 Afterparty Featuring: Start Today Suedo Youth Free with RSVP All Ages This is an all ages event Presented by Converse. Venue Oblivion 6118 North Figueroa Street, Los Angeles, California 90042, United States Open in maps Follow Doors open 7:00 PM 108 capacity Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ticket with a friend, or get a refund to a sold-out show. No stress. iOS Android DICE protects ",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Double Trouble",
      "date": "2027-02-07",
      "time": "9:00 PM",
      "location": "The Airliner",
      "link": "https://dice.fm/event/6dnx93-double-trouble-7th-feb-the-airliner-los-angeles-tickets",
      "description": "Double Trouble The Airliner Sat, Feb 7, 9:00 PM Party Los Angeles Selling fast Off Sale Got a code? About Double Trouble feat. Shabzi B2B Yoni & Benka B2B EYAL Pairs of DJ’s putting their styles and talents together to bring you selections that span the universes of house, disco, electro, techno. Shabzi & Yoni will open the evening, Benka & EYAL will keep tak... Read more This is a 21+ event Presented by The Airliner. Venue The Airliner 2419 N Broadway, Los Angeles, CA 90031, USA Open in maps Follow Doors open 9:00 PM Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "System Error: FLOZONE, STVSH, BABY KUSH",
      "date": "2027-02-07",
      "time": "9:00 PM",
      "location": "1720",
      "link": "https://dice.fm/event/xe79kk-system-error-flozone-stvsh-baby-kush-7th-feb-1720-los-angeles-tickets",
      "description": "System Error: FLOZONE, STVSH, BABY KUSH 1720 Sat, Feb 7, 9:00 PM DJ Los Angeles Selling fast $27.30 The price you'll pay. No surprises later. Buy now Got a code? About SYSTEM ERROR PRESENTS FLOZONE STVSH BABY KUSH 18+ / 9PM DOORS This is an 18+ event System Error presents Lineup Baby Kush Follow Venue 1720 1720 E 16th St, Los Angeles, California 90021, United States Open in maps Follow Doors open 9:00 PM Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ticket with a friend, or get a refund to a sold-out show. No stress. iOS Android DICE protects fans and artists from",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Holy Trinity: THE CURE vs THE SMITHS vs DEPECHE MODE",
      "date": "2027-02-07",
      "time": "10:00 PM",
      "location": "Zebulon",
      "link": "https://dice.fm/event/8e8b8v-holy-trinity-the-cure-vs-the-smiths-vs-depeche-mode-7th-feb-zebulon-los-angeles-tickets",
      "description": "Holy Trinity: THE CURE vs THE SMITHS vs DEPECHE MODE Zebulon Sat, Feb 7, 10:00 PM Gigs Los Angeles Selling fast Free The price you'll pay. No surprises later. Buy now Got a code? About Holy Trinity: THE CURE vs THE SMITHS vs DEPECHE MODE This is a 21+ event Presented by Zebulon. Venue Zebulon 2478 Fletcher Dr, Los Angeles, CA 90039, USA Open in maps Follow Doors open 10:00 PM 300 capacity Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ticket with a friend, or get a refund to a sold-out show. No stress. iOS Android DICE protects fans and artists from resellers. Tick",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "The Hustle ~ First and Third Saturday Disco Party!",
      "date": "2027-02-07",
      "time": "10:30 PM",
      "location": "Gold-Diggers",
      "link": "https://dice.fm/event/rynoyv-the-hustle-first-and-third-saturday-disco-party-7th-feb-gold-diggers-los-angeles-tickets",
      "description": "The Hustle ~ First and Third Saturday Disco Party! Gold-Diggers Sat, Feb 7, 10:30 PM DJ Los Angeles Free The price you'll pay. No surprises later. Buy now Got a code? About 💋 DISCO DOLLYS… WE’RE BACK 💋 THE HUSTLE returns at a brand-new home — find us under the disco balls at Gold-Diggers ✨🕺💃 🪩 Saturday, January 3rd, 2026 📍 Gold-Diggers 5632 Santa Monica Blvd, Los Angeles ⏰ 10PM 💸 FREE at the door Global disco,... Read more This is an 21+ event Presented by Gold-Diggers. Venue Gold-Diggers 5632 Santa Monica Blvd, Los Angeles, CA 90038 Open in maps Follow Doors open 10:30 PM Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening t",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Nightshift Afterhours",
      "date": "2027-02-07",
      "time": "11:00 PM",
      "location": "Location TBA, Los Angeles",
      "link": "https://dice.fm/event/92wam7-nightshift-afterhours-7th-feb-location-tba-los-angeles-los-angeles-tickets",
      "description": "Nightshift Afterhours Location TBA, Los Angeles Sat, Feb 7, 11:00 PM DJ Los Angeles Selling fast From Free The price you'll pay. No surprises later. Buy now Got a code? About Step into the underground at Nightshift' DTLA's Premier after-hours speakeasy experience.seven nights a week, we curate the finest Minimal Tech House Dj lineups, delivering deep grooves and high energy sets that keep you moving till sunrise! Come early, s... Read more This is a 21+ event. Presented by Blind Tiger. No Covid-19 entry requirements Venue Location TBA, Los Angeles Los Angeles, California 90013, United States Open in maps Doors open 11:00 PM Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving ev",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Kenny Mattucci, Scout Gillet, Dreyted, Lackey",
      "date": "2026-02-08",
      "time": "8:00 PM",
      "location": "Zebulon",
      "link": "https://dice.fm/event/bb3dvk-kenny-mattucci-scout-gillet-dreyted-lackey-8th-feb-zebulon-los-angeles-tickets",
      "description": "Kenny Mattucci, Scout Gillet, Dreyted, Lackey Zebulon Sun, Feb 8, 8:00 PM Gigs Los Angeles Free The price you'll pay. No surprises later. Buy now Top track Scout Gillett - one to ten Got a code? About Kenny Mattucci, Scout Gillet, Dreyted, Lackey This is a 21+ event Presented by Zebulon. Lineup Scout Gillett Follow Kenny Matucci Follow Dreyted Lackey Venue Zebulon 2478 Fletcher Dr, Los Angeles, CA 90039, USA Open in maps Follow Doors open 8:00 PM 300 capacity Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ticket with a friend, or get a refund to a sold-out show. No",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Nightshift Afterhours",
      "date": "2026-02-08",
      "time": "11:00 PM",
      "location": "Location TBA, Los Angeles",
      "link": "https://dice.fm/event/3ogw2x-nightshift-afterhours-8th-feb-location-tba-los-angeles-los-angeles-tickets",
      "description": "Nightshift Afterhours Location TBA, Los Angeles Sun, Feb 8, 11:00 PM DJ Los Angeles From Free The price you'll pay. No surprises later. Buy now Got a code? About Step into the underground at Nightshift' DTLA's Premier after-hours speakeasy experience.seven nights a week, we curate the finest Minimal Tech House Dj lineups, delivering deep grooves and high energy sets that keep you moving till sunrise! Come early, s... Read more This is a 21+ event. Presented by Blind Tiger. No Covid-19 entry requirements $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue Location TBA, Los Angeles Los Angeles, California 90013, United States Open in maps Doors open 11:00 PM Download the",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Homicide: Life on the Streets (DJs)",
      "date": "2026-02-09",
      "time": "5:00 PM",
      "location": "Sid's Bar",
      "link": "https://dice.fm/event/bb3n6k-homicide-life-on-the-streets-djs-9th-feb-sid-the-cat-auditorium-south-pasadena-tickets",
      "description": "Homicide: Life on the Streets (DJs) Sid's Bar Mon, Feb 9, 5:00 PM Gigs Pasadena Free The price you'll pay. No surprises later. Buy now Got a code? About Sid The Cat Presents Homicide: Life on the Streets (DJs) Spinning Music Made Between January 31st, 1993 and May 21st, 1999. 2/9/2026 at Sid's Bar 5pm - Close This is an All Ages event. Presented by Sid The Cat Auditorium. Lineup Sid The Cat DJs Venue Sid The Cat Auditorium 1022 El Centro Street, South Pasadena, California 91030, United States Open in maps Follow Doors open 5:00 PM FAQs Can I buy tickets in person? If the show has not sold out in advance, you can purchase tickets at the door during the event. Where are you located? We are located at 1022 El Centro St. South Pasadena, CA 91030 in the heart of Downtown South Pas. Enter the ve",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "CLOSED Tonight",
      "date": "2026-02-09",
      "time": "6:00 PM",
      "location": "Zebulon",
      "link": "https://dice.fm/event/bb8e8v-closed-tonight-9th-feb-zebulon-los-angeles-tickets",
      "description": "CLOSED Tonight Zebulon Mon, Feb 9, 6:00 PM Gigs Los Angeles Free The price you'll pay. No surprises later. Sold out Got a code? About We Are CLOSED Tonight This is a 21+ event Presented by Zebulon. Venue Zebulon 2478 Fletcher Dr, Los Angeles, CA 90039, USA Open in maps Follow Doors open 6:00 PM 300 capacity Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ticket with a friend, or get a refund to a sold-out show. No stress. iOS Android DICE protects fans and artists from resellers. Tickets will be securely stored in the app.",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Christina Galisatus, Nick Dorian",
      "date": "2026-02-09",
      "time": "8:00 PM",
      "location": "Club Tee Gee",
      "link": "https://dice.fm/event/wwr6dn-christina-galisatus-nick-dorian-9th-feb-club-tee-gee-los-angeles-tickets",
      "description": "Christina Galisatus, Nick Dorian Club Tee Gee Mon, Feb 9, 8:00 PM Gigs Los Angeles Free The price you'll pay. No surprises later. Buy now Top track Follow The Leader Got a code? About Born and raised in San Francisco and currently based in Los Angeles, Christina Galisatus is a pianist, composer, vocalist, and songwriter whose music is grounded in emotional honesty and purposeful restraint. Having cultivated a distinctive sound as both a... Read more This is a 21+ event Presented by Healing Force of the Universe. Lineup Christina Galisatus Follow Nick Dorian Follow Venue Club Tee Gee 3210 Glendale Blvd, Los Angeles, CA 90039, USA Open in maps Follow Doors open 8:00 PM Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library.",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Nightshift Afterhours",
      "date": "2026-02-09",
      "time": "11:00 PM",
      "location": "Location TBA, Los Angeles",
      "link": "https://dice.fm/event/eorkk2-nightshift-afterhours-9th-feb-location-tba-los-angeles-los-angeles-tickets",
      "description": "Nightshift Afterhours Location TBA, Los Angeles Mon, Feb 9, 11:00 PM DJ Los Angeles From Free The price you'll pay. No surprises later. Buy now Got a code? About Step into the underground at Nightshift' DTLA's Premier after-hours speakeasy experience.seven nights a week, we curate the finest Minimal Tech House Dj lineups, delivering deep grooves and high energy sets that keep you moving till sunrise! Come early, s... Read more This is a 21+ event. Presented by Blind Tiger. No Covid-19 entry requirements $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue Location TBA, Los Angeles Los Angeles, California 90013, United States Open in maps Doors open 11:00 PM Download the",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Two Step Tuesday: Sweet D's Country Revue",
      "date": "2026-02-10",
      "time": "8:00 PM",
      "location": "Club Tee Gee",
      "link": "https://dice.fm/event/6d23k7-two-step-tuesday-sweet-ds-country-revue-10th-feb-club-tee-gee-los-angeles-tickets",
      "description": "Two Step Tuesday: Sweet D's Country Revue Club Tee Gee Tue, Feb 10, 8:00 PM Gigs Los Angeles Free The price you'll pay. No surprises later. Buy now Top track Don't Fence Me In Got a code? About We're bringing back Sweet D (Darla Hawn) for this Two Step Tuesday at Club Tee Gee. Doors at 8 PM. Free show. 21+ This is a 21+ event Presented by Healing Force of the Universe. Lineup Darla Hawn Follow Venue Club Tee Gee 3210 Glendale Blvd, Los Angeles, CA 90039, USA Open in maps Follow Doors open 8:00 PM Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ticket with a friend, ",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Luke Temple & the Cascading Moms, Hirons, Dylan Marx",
      "date": "2026-02-10",
      "time": "8:00 PM",
      "location": "Zebulon",
      "link": "https://dice.fm/event/8e8gm2-luke-temple-the-cascading-moms-hirons-dylan-marx-10th-feb-zebulon-los-angeles-tickets",
      "description": "Luke Temple & the Cascading Moms, Hirons, Dylan Marx Zebulon Tue, Feb 10, 8:00 PM Gigs Los Angeles Free The price you'll pay. No surprises later. Buy now Top track Florida Got a code? About Luke Temple & the Cascading Moms, Hirons, Dylan Marx DJ Privacy Settings (Kevin Greenspon) This is a 21+ event Presented by Zebulon. Lineup Luke Temple Follow Luke Temple and The Cascading Moms Follow Dylan Marx Hirons Venue Zebulon 2478 Fletcher Dr, Los Angeles, CA 90039, USA Open in maps Follow Doors open 8:00 PM 300 capacity Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your tick",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Alex's Bar Karaoke",
      "date": "2026-02-10",
      "time": "8:00 PM",
      "location": "Alex's Bar",
      "link": "https://dice.fm/event/eown8d-alexs-bar-karaoke-10th-feb-alexs-bar-long-beach-tickets",
      "description": "Alex's Bar Karaoke Alex's Bar Tue, Feb 10, 8:00 PM Gigs Long Beach Free The price you'll pay. No surprises later. Buy now Got a code? About Join us for our FREE weekly karaoke night. KJ Phil Acosta hosts and choose from an extrensive song list! This is a 21+ event Presented by Alex's Bar. Venue Alex's Bar 2913 E Anaheim St, Long Beach, CA 90804, USA Open in maps Follow Doors open 8:00 PM 300 capacity Promoter Alex's Bar Follow FAQs Do I Need A Photo ID To Enter? Yes! You must be 21 and have a valid unexpired government issued photo ID. No exceptions. Your information must match the information on your ticket to enter a show. Do You Offer Non-Alcoholic Options? Yes! We have a variety of N/A beers as well as mocktails! Ask your bartender about our N/A options! Do You Serve Drinks? Yes! We of",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Nightshift Afterhours",
      "date": "2026-02-10",
      "time": "11:00 PM",
      "location": "Location TBA, Los Angeles",
      "link": "https://dice.fm/event/avpaa7-nightshift-afterhours-10th-feb-location-tba-los-angeles-los-angeles-tickets",
      "description": "Nightshift Afterhours Location TBA, Los Angeles Tue, Feb 10, 11:00 PM DJ Los Angeles From Free The price you'll pay. No surprises later. Buy now Got a code? About Step into the underground at Nightshift' DTLA's Premier after-hours speakeasy experience.seven nights a week, we curate the finest Minimal Tech House Dj lineups, delivering deep grooves and high energy sets that keep you moving till sunrise! Come early, s... Read more This is a 21+ event. Presented by Blind Tiger. No Covid-19 entry requirements $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue Location TBA, Los Angeles Los Angeles, California 90013, United States Open in maps Doors open 11:00 PM Download th",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Clinic ft. Cici (DSK Records)",
      "date": "2026-02-11",
      "time": "10:00 AM",
      "location": "Jungle Hollywood",
      "link": "https://dice.fm/event/g5dapp-clinic-ft-cici-dsk-records-11th-feb-jungle-hollywood-west-hollywood-tickets",
      "description": "Clinic ft. Cici (DSK Records) Jungle Hollywood Wed, Feb 11, 10:00 AM Gigs West Hollywood From Free The price you'll pay. No surprises later. Buy now Got a code? About Clinic welcomes Cici (DSK Records) Wednesday, February 11 🎟 Free entry with RSVP (10–11 PM) 🍸 Drink Specials ‘til Midnight • $8 Shots • $12 Cocktails 🛍 Outdoor Vendor Market ✨ For VIP Table Reservations & Inquiries: info@underratedpresents.com 2... Read more This is a 21+ event Presented by Underrated Presents. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue Jungle Hollywood 1640 N Cahuenga Blvd, Los Angeles, CA 90028, USA Open in maps Doors open 10:00 AM 250 capacity Promoter Underrated Presents Foll",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Brain Party Trivia",
      "date": "2026-02-11",
      "time": "6:30 PM",
      "location": "Alex's Bar",
      "link": "https://dice.fm/event/pyp3b8-brain-party-trivia-11th-feb-alexs-bar-long-beach-tickets",
      "description": "Brain Party Trivia Alex's Bar Wed, Feb 11, 6:30 PM Gigs Long Beach Free The price you'll pay. No surprises later. Buy now Got a code? About Join us for Brain Party trivia. Winning team collects all money! $5 per person and teams of up to 6 players This is a 21+ event Presented by Alex's Bar. Venue Alex's Bar 2913 E Anaheim St, Long Beach, CA 90804, USA Open in maps Follow Doors open 6:30 PM 300 capacity Promoter Alex's Bar Follow FAQs Do I Need A Photo ID To Enter? Yes! You must be 21 and have a valid unexpired government issued photo ID. No exceptions. Your information must match the information on your ticket to enter a show. Do You Offer Non-Alcoholic Options? Yes! We have a variety of N/A beers as well as mocktails! Ask your bartender about our N/A options! Do You Serve Drinks? Yes! We",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "rocknite.la w/ June Youngblood/Boy Bloom/Paige P!",
      "date": "2026-02-11",
      "time": "8:00 PM",
      "location": "The Goldfish",
      "link": "https://dice.fm/event/nvkr2l-rocknitela-w-june-youngbloodboy-bloompaige-p-11th-feb-the-goldfish-los-angeles-tickets",
      "description": "rocknite.la w/ June Youngblood/Boy Bloom/Paige P! The Goldfish Wed, Feb 11, 8:00 PM Gigs Los Angeles Free The price you'll pay. No surprises later. Buy now Got a code? About rocknite.la with June Youngblood, Boy Bloom and Paige Pedersen! Free and 21+ at the goldfish : ) This is a 21+ event Presented by The Goldfish. Venue The Goldfish 5043 York Blvd, Los Angeles, CA 90042, USA Open in maps Follow Doors open 8:00 PM Download the DICE app Discover the best nights out in your city, with tailored recommendations synced to your music library. Keep track of what’s coming up by saving events, sharing them with friends, or even listening to new music in the app. We’ve made it easy to swap your ticket with a friend, or get a refund to a sold-out show. No stress. iOS Android DICE protects fans and a",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Into Action, Babe's Kitchen, Sanguine Knight",
      "date": "2026-02-11",
      "time": "9:00 PM",
      "location": "Alex's Bar",
      "link": "https://dice.fm/event/eo365y-into-action-babes-kitchen-sanguine-knight-11th-feb-alexs-bar-long-beach-tickets",
      "description": "Into Action, Babe's Kitchen, Sanguine Knight Alex's Bar Wed, Feb 11, 9:00 PM Gigs Long Beach Free The price you'll pay. No surprises later. Buy now Got a code? About Wednesday night rager with Into Action, Babe's Kitchen & Sanguine Knight! This is a 21+ event Presented by Alex's Bar. Venue Alex's Bar 2913 E Anaheim St, Long Beach, CA 90804, USA Open in maps Follow Doors open 9:00 PM 300 capacity Promoter Alex's Bar Follow FAQs Do I Need A Photo ID To Enter? Yes! You must be 21 and have a valid unexpired government issued photo ID. No exceptions. Your information must match the information on your ticket to enter a show. Do You Offer Non-Alcoholic Options? Yes! We have a variety of N/A beers as well as mocktails! Ask your bartender about our N/A options! Do You Serve Drinks? Yes! We offer a",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Nightshift Afterhours",
      "date": "2026-02-11",
      "time": "11:00 PM",
      "location": "Location TBA, Los Angeles",
      "link": "https://dice.fm/event/avpa67-nightshift-afterhours-11th-feb-location-tba-los-angeles-los-angeles-tickets",
      "description": "Nightshift Afterhours Location TBA, Los Angeles Wed, Feb 11, 11:00 PM DJ Los Angeles From Free The price you'll pay. No surprises later. Buy now Got a code? About Step into the underground at Nightshift' DTLA's Premier after-hours speakeasy experience.seven nights a week, we curate the finest Minimal Tech House Dj lineups, delivering deep grooves and high energy sets that keep you moving till sunrise! Come early, s... Read more This is a 21+ event. Presented by Blind Tiger. No Covid-19 entry requirements $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue Location TBA, Los Angeles Los Angeles, California 90013, United States Open in maps Doors open 11:00 PM Download th",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    },
    {
      "title": "Boogieverse",
      "date": "2026-02-12",
      "time": "5:00 PM",
      "location": "Sid's Bar",
      "link": "https://dice.fm/event/oeg7ya-boogieverse-12th-feb-sid-the-cat-auditorium-south-pasadena-tickets",
      "description": "Boogieverse Sid's Bar Thu, Feb 12, 5:00 PM Gigs Pasadena Free The price you'll pay. No surprises later. Buy now Got a code? About Sid The Cat Presents Boogieverse V Fresh & Deejay Clifton at Sid's Bar 7pm - close This is an All Ages event. Presented by Sid The Cat Auditorium. Lineup Sid The Cat DJs Venue Sid The Cat Auditorium 1022 El Centro Street, South Pasadena, California 91030, United States Open in maps Follow Doors open 5:00 PM FAQs Can I buy tickets in person? If the show has not sold out in advance, you can purchase tickets at the door during the event. Where are you located? We are located at 1022 El Centro St. South Pasadena, CA 91030 in the heart of Downtown South Pas. Enter the venue on Fairview St. Where can I purchase tickets? You can purchase tickets online for all shows, w",
      "source": "Dice.fm",
      "city": "ca--los-angeles"
    }
  ],
  "total": 24,
  "last_updated": "2026-02-07T23:36:07.729969"
}