{
  "cities": {
    "fl--miami": {
      "events": [
        {
          "title": "Turning Engagement Into Customers on X",
          "date": "2026-02-09",
          "time": "5:30 PM",
          "location": "Coral Gables, Florida",
          "link": "https://lu.ma/n3q1sthr",
          "description": "​ How can startups turn marketing activity into real customers that support business growth? Join us for an invite-only fireside chat with Marco Botero, Managing Director for Canada & Latin America at X , moderated by Armin ZadakBar, CEO of The Armin Bar (Miami|Milan) . Together, we will explore how startups can use X as a high-impact channel to build relevance that drives business outcomes. The conversation will focus on practical insights, real-world strategies, and best practices for building",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "CONTEMPO: Rhythm in Color Workshop",
          "date": "2026-02-09",
          "time": "6:30 PM",
          "location": "Snyder & Hugo R. Loredo ArtHood56",
          "link": "https://lu.ma/q1hbmw64",
          "description": "​ Hosted and curated by Abbey Gadinsky-Snyder & Artist Hugo Co-Founders of CONTEMPO ​ CONTEMPO: Rhythm in Color ​ An immersive art and music learning workshop where rhythm guides color and creativity unfolds without pressure or perfection. ​ CONTEMPO is a fluid expression of rhythm and color — an elevated evening designed to connect and create through guided artistic and musical exploration. ​ The Experience ​ 6:30 – 7:30 PM | Community Dinner A thoughtfully curated communal dinner by LIRA Beiru",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Habitus of Her: Curating Your Space Masterclass",
          "date": "2026-02-09",
          "time": "7:00 PM",
          "location": "Jacques",
          "link": "https://lu.ma/3zs4tj7v",
          "description": "​ Transform your environment from a place you live into a sanctuary that serves your vision, goals and who you are becoming. ​ We will be in conversation with Sarah Nelson, CEO of Less Is More Organizing ​ About the Event: ​ Your environment is a silent mirror of your internal world. When we move beyond \"organizing\" and into \"curating,\" we stop just moving things around and start creating room for opportunity to land. ​ Join HerKind for an intimate, conversation-led session where we explore the ",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "MIAMI! KENDRA G SINGLES LIVE TOUR!",
          "date": "2026-02-10",
          "time": "6:00PM",
          "location": "Miami · Kitchen + Kocktails By: Kevin Kelley - Miami",
          "link": "https://www.eventbrite.com/e/miami-kendra-g-singles-live-tour-tickets-1981451703384",
          "description": "Miami! Come meet the hottest SINGLES in your city! KENDRA G SINGLES LIVE TOUR KICKS off in MIAMI at Kitchen & Kocktail! Miami! Come meet the hottest SINGLES in your city! KENDRA G SINGLES LIVE TOUR KICKS off in MIAMI at Kitchen & Kocktail!",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Stranger Things Trivia Night w/ Prizes + Drink Specials",
          "date": "2026-02-10",
          "time": "8:00PM",
          "location": "Doral · Copper Blues Rock Pub & Kitchen",
          "link": "https://www.eventbrite.com/e/stranger-things-trivia-night-w-prizes-drink-specials-tickets-1982006036409",
          "description": "Test your Stranger Things mastery and win awesome prizes while enjoying drink specials! A fun night of gaming + trivia hosted by Cafecito Start your Tuesday night with games, drinks, and a little throwback fun at Copper Blues Doral. We’re kicking things off with Mario Kart, then rolling straight into Stranger Things trivia, plus drink specials and prizes for winners. Get here early to race while everyone’s arriving, then stick around to show off what you know about Hawkins, the Upside Down, and ",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Ten years of NewsMatch",
          "date": "2026-02-11",
          "time": "5:00PM",
          "location": "Miami · InterContinental Miami, an IHG Hotel",
          "link": "https://www.eventbrite.com/e/ten-years-of-newsmatch-tickets-1981351160658",
          "description": "Join the Institute for Nonprofit News at Knight Media Forum to celebrate 10 years of our NewsMatch program! Who: INN members, friends and advocates What: Raise a toast to 10 years of NewsMatch! When: Wednesday, Feb. 11 from 5 to 6:30 p.m. Where: Chopin Ballroom at the InterContinental Miami Read more Join the Institute for Nonprofit News at Knight Media Forum to celebrate 10 years of our NewsMatch program! Who: INN members, friends and advocates What: Raise a toast to 10 years of NewsMatch! When",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Restoration Association of FL Presents Lunch and Learn in Miami!",
          "date": "2026-02-11",
          "time": "12:00PM",
          "location": "Miami · 6750 NW 7th St",
          "link": "https://www.eventbrite.com/e/restoration-association-of-fl-presents-lunch-and-learn-in-miami-tickets-1981951198387",
          "description": "Network, learn & connect with pros! Sponsored by Kanner & Pintaluga. Welcome to the Lunch & Learn event! Join us on February 11th from 12–2PM (ET) at the Holiday Inn Express Miami Airport Blue Lagoon for an informative and practical session. Come hungry for both knowledge and a great meal, and take advantage of the opportunity to network with industry professionals. We look forward to seeing you there! When: February 11th Where: Holiday Inn Express Miami Airport Blue Lagoon 6750 Nw 7th St Miami,",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Brickell- Language Exchange & Networking at Rosa Sky",
          "link": "https://www.meetup.com/miami-old-and-new-in-town-meetup-group/events/313042560/",
          "date": "2026-02-11",
          "time": "7:00PM",
          "location": "Rosa Sky Rooftop",
          "description": "In-person language exchange and networking for newcomers and locals to practice languages and expand international contacts.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Join the most successful free networking event in Coral Gables",
          "link": "https://www.meetup.com/coral-gables-networking-powered-by-rockstar-connect/events/312900598/",
          "date": "2026-02-11",
          "time": "6:00PM",
          "location": "321 Miracle Mile · Coral Gables, FL",
          "description": "Your Community Starts Here in Coral Gables!\n\nWhat if building your network was as easy as sharing a laugh and a story? This isn’t your typical rigid networking — Coral Gables Networking powered by Roc",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Fort Lauderdale Las Olas Rooftop EVO VC & Startups Social🍸🎉",
          "date": "2026-02-11",
          "time": "6:30 PM",
          "location": "Gozel Akeyeva Rooftop @1WLO",
          "link": "https://lu.ma/wkohhror",
          "description": "​ Join us for the Las Olas Rooftop Tech + Startups Social🍸🎉 ​ Build. Connect. Scale. ​ ​​​This isn’t just another networking event. It’s a room full of builders - founders, investors, and innovators - who move fast, think big, and want to create something that matters. ​ ​​​🌐 Join the Community: evovcstartups.com ​ ​​​You’ll meet people who speak your language - Tech growth, capital, innovation. You’ll leave with connections, clarity, and energy to take your startup to the next level. ​ ​​​ EVO ",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Date Knight at The Shelborne",
          "date": "2026-02-11",
          "time": "7:00 PM",
          "location": "Knightcap Chess Club & Ian S The Shelborne By Proper",
          "link": "https://lu.ma/ivkfvjtb",
          "description": "​ This is an open-invitation Valentine’s Day event for singles, couples, friends, and everyone in between 💖 ​ ​Enjoy the music, enjoy the ambience and most of all, enjoy the company. Doesn't matter if you’re a Grandmaster, a beginner, or don’t even know how to play, this event is for everyone. ​ ​Eight by eight ‘til late 🍸 ♟️",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Yeshhayahu, Georgia Mafia, Bemet, Rozzi",
          "date": "2026-02-11",
          "time": "10:00PM",
          "location": "Do Not Sit On The Furniture",
          "link": "https://dice.fm/event/92ae8d-yeshhayahu-georgia-mafia-bemet-rozzi-11th-feb-do-not-sit-on-the-furniture-miami-beach-tickets",
          "description": "Wednesday, February 11th Do Not Sit On The Furniture presents Yeshhayahu Georgia Mafia Bemet Rozzi Jessy Nimni from 10 pm to 5 am. Come enjoy our magical venue... Please note, table reservations are highly recommended.. Table Reservations: Please cal... Read more This is a 21+ event. Presented by Do Not Sit On The Furniture. No Covid-19 entry requirements $ You can get a refund if: It’s within 48 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hour",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Klose Frnds Ladies Night",
          "date": "2026-02-12",
          "time": "7:00PM",
          "location": "Miami · 2219 NW 2nd Ave",
          "link": "https://www.eventbrite.com/e/klose-frnds-ladies-night-tickets-1982473636012",
          "description": "Let's get Kloser for drinks, skincare and good music. Let's get Kloser for drinks, skincare and good music.",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Friend Match at Vizcaya Village Night Market",
          "date": "2026-02-12",
          "time": "6:00PM",
          "location": "Miami · Vizcaya Village",
          "link": "https://www.eventbrite.com/e/friend-match-at-vizcaya-village-night-market-tickets-1981603247657",
          "description": "Because Valentine’s Day is about more than romantic love In Mexico, February 14th isn't just for couples. El Día del Amor y la Amistad celebrates the love we have for our friends as well our romantic partners. We’re honoring that tradition with an evening of platonic friendship matching for adults 21+ at the Vizcaya Village Night Market on Thursday, Feb. 12. Take a short quiz on your phone, and the viral Matchbox software will match you with a compatible new friend. Find each other in the crowd,",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Single's video call",
          "link": "https://www.meetup.com/miami-speed-dating-love-and-friendship/events/313247032/",
          "date": "2026-02-12",
          "time": "4:00PM",
          "location": "Every week on Thursday, Friday, Saturday, Sunday until August 3, 2026",
          "description": "Extend your circle and break the cycle of daily work/commute. Join us in a video chat meeting for singles in Miami and all USA. Subscribe freely on [https://visio-dating.com/en/](https://visio-dating.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "The Rookery at the Brightline Station",
          "date": "2026-02-12",
          "time": "6:00 PM",
          "location": "Nicholas Lvoff The Wolf Of Tacos",
          "link": "https://lu.ma/xbfml00n",
          "description": "​ The Rookery Chess Club is back! ​ ​ Join us at The Wolf of Tacos for our next chess social event on Thursday, February 12th! Whether you’re a titled chess player, or just trying to remember how the castle moves, all are welcome at The Rookery. ​ ​ 🔸 Date: Thursday, February 12th ​ 🔸 Time: 6 - 10 PM ​ 🔸  Admission: Free ​ 🔸 Location: The Wolf of Tacos 🌮",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "TIMEPIECE GRADING",
          "date": "2026-02-12",
          "time": "7:00 PM",
          "location": "Mia Watch Club Red Phone Booth",
          "link": "https://lu.ma/8nnrsdvu",
          "description": "​ Join MIA Watch Club for an exclusive evening dedicated to the art and science of timepiece grading. Hosted by Fred Savage, this intimate session will explore what truly defines quality, condition, and value in fine watches, offering insider insight for collectors and enthusiasts alike. ​ The event will take place in the private Member Lounge on the second floor of Red Phone Booth, providing a refined setting for conversation, learning, and connection.",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Dance Enhancer Be My Valentine Showcase",
          "date": "2026-02-12",
          "time": "10:00PM",
          "location": "Do Not Sit On The Furniture",
          "link": "https://dice.fm/event/53ronw-dance-enhancer-be-my-valentine-showcase-12th-feb-do-not-sit-on-the-furniture-miami-beach-tickets",
          "description": "Thursday, February 12th Do Not Sit On The Furniture presents Dance Enhancer Be My Valentine Showcase Alan Epps George Vidal Louie Danger Jessy Nimni Teknetron from 10 pm to 5 am. Come enjoy our magical venue... Please note, table reservations are hi... Read more This is a 21+ event. Presented by Do Not Sit On The Furniture. No Covid-19 entry requirements $ You can get a refund if: It’s within 48 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Wassup by Hopeful Jo",
          "date": "2026-02-12",
          "time": "11:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/py9oxw-wassup-by-hopeful-jo-12th-feb-mode-miami-tickets",
          "description": "Wassup returns to MODE on with a night stacked in sound and energy. Together, they’ll shape the dancefloor into something unforgettable. Step in and find out what Wassup really means. This is an 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue MODE 2 S Miami Ave, Miami, Florida 33130, United States Open in maps Follow Doors open 11:00 PM EST D",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Do Not Disturb: No Phone Party + Y2K Jams! (Galentine's Edition)",
          "date": "2026-02-13",
          "time": "9:00PM",
          "location": "Miami · Tipsy Flamingo Cocktail Bar",
          "link": "https://www.eventbrite.com/e/do-not-disturb-no-phone-party-y2k-jams-galentines-edition-tickets-1981270396089",
          "description": "Do Not Disturb Party @ Tipsy Flamingo | Free Welcome Drink | No Phones Allowed |Friday, February 13th | Galentine's Edition Valentine’s is for the couples, but Friday the 13th is for the girls. Join us for a special Galentine's Edition of Do Not Disturb —Miami’s original NO PHONE party. The rules are simple: Your phone goes in a secure pouch at the door so you can actually be present with your crew. We’re trading the scrolling for Y2K throwbacks , fake microphones, and zero distractions. Since y",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Documentary Screening The Fragility of Tradition By Stella M. Holmes",
          "date": "2026-02-13",
          "time": "6:00PM",
          "location": "Coral Gables · Coral Gables Museum",
          "link": "https://www.eventbrite.com/e/documentary-screening-the-fragility-of-tradition-by-stella-m-holmes-tickets-1981879989399",
          "description": "This program is part of Five Senses of Japan, a curated exploration of Japanese culture across disciplines and sensory experience. This documentary focuses on three Japanese female artists at different stages of their lives and careers. Each woman is as distinctive as her intricate and powerful artwork, yet their stories converge through shared struggle. Together, they stand as artistic sisters in a society where for centuries Kogei was a strictly male-dominated field—one in which women, regardl",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Mount Gay Rum Tasting Event",
          "date": "2026-02-13",
          "time": "9:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/l89yar-mount-gay-rum-tasting-event-13th-feb-mode-miami-tickets",
          "description": "Join us Friday, February 13th at MODE for an exclusive Mount Gay Rum Tasting Event. Experience the craft behind Mount Gay Rum with complimentary samples and learn about what makes thier spirits stand out. Space is limited, and RSVP is required to attend... Read more This is an 21+ event Presented by MODE. Venue MODE 2 S Miami Ave, Miami, Florida 33130, United States Open in maps Follow Doors open 9:00 PM EST Download the DICE app Discover the best nights out in your city, with tailored recommend",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Ctrl Room ",
          "date": "2026-02-13",
          "time": "10:00PM",
          "location": "M2 Miami",
          "link": "https://dice.fm/event/rynog5-ctrl-room-13th-feb-m2-miami-miami-beach-tickets",
          "description": "CTRL Room is a late-night experience built in low light and heavy sound. Immersive visuals, deep rhythms, and a tightly curated lineup guide the night into an after-hours flow where control fades and energy takes over. This Valentine’s edition leans into t... Read more This is a 21+ event Pitch Park $ You can get a refund if: This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Lineup AUDIOSAL LEO OLIVER LEO ROJAS MILES JORDAN NUWA SABLE SAMIRON ",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Love/Lust with Andrea Quintero & More",
          "date": "2026-02-13",
          "time": "11:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/53ro2l-lovelust-with-andrea-quintero-more-13th-feb-mode-miami-tickets",
          "description": "House of Huemans returns to MODE for Love/Lust, a night rooted in connection, movement, and late-night emotion. Leading the experience is Andrea Quintero, whose sound blends sensual house, melodic depth, and driving rhythms designed to pull you inward and... Read more This is an 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue MODE 2 S Miami A",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "The Tipsy Love Hour - Valentine's Hip-Hop & R&B Throwback Party!",
          "date": "2026-02-14",
          "time": "9:00PM",
          "location": "Miami · Tipsy Flamingo Cocktail Bar",
          "link": "https://www.eventbrite.com/e/the-tipsy-love-hour-valentines-hip-hop-rb-throwback-party-tickets-1981270665896",
          "description": "The Tipsy Love Hour @ Tipsy Flamingo | Free Welcome Drink | R&B + Hip-Hop Throwbacks |Saturday, February 14 | Live Song Dedications Valentine’s Day is usually a cliché—we’re making it a party. Join us on Saturday, Feb. 14 for Tipsy Love Hour , a one-night-only event where you control the soundtrack. The rules are simple: Head to the booth, submit your song request, and write out a dedication. Our DJ will shout out your message live on the mic before blending your track into the mix. Whether you'",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Wynwood Art Walk: Valentine’s Edition",
          "date": "2026-02-14",
          "time": "12:00PM",
          "location": "Miami · Wynwood Business Improvement District",
          "link": "https://www.eventbrite.com/e/wynwood-art-walk-valentines-edition-tickets-1980634858178",
          "description": "This February, Wynwood Art Walk invites you to experience the neighborhood through love, art, and food. This February, Wynwood Art Walk invites you to experience the neighborhood through love, art, food, and shopping. Come celebrate love in all its forms — love for art, food, shopping, culture, community, and each other. On Saturday, February 14th, from 12:00 p.m. to 10:00 p.m. , Wynwood transforms into a vibrant celebration of connection, creativity, and community. Whether you’re celebrating wi",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Shoot Ur Shot: Our Two-Year Anniversary Party",
          "date": "2026-02-14",
          "time": "7:00PM",
          "location": "Miami · The Corner",
          "link": "https://www.eventbrite.com/e/shoot-ur-shot-our-two-year-anniversary-party-tickets-1981602952775",
          "description": "Be brave. Be cringe even! Celebrate two years of We Met in Miami with liquid courage shots, cheeky valentines & astro readings at The Corner Courage is sexy af. If we've learned anything since our launch in February 2024, it's that meaningful connection requires vulnerability. Making a new friend or romantic connection takes showing up in person with an open heart. Let our two-year anniversary be your excuse to finally ... Shoot ur shot: Enjoy free liquid courage shots by Aphlora Slip someone yo",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Roses & Rosé Rooftop Party",
          "date": "2026-02-14",
          "time": "8:00PM",
          "location": "Miami · Sipsip Rum Bar",
          "link": "https://www.eventbrite.com/e/roses-rose-rooftop-party-tickets-1981429895155",
          "description": "Sip rosé, enjoy rooftop views, and vibe all night at the ultimate Valentine's party! Roses & Rosé Rooftop Party Get ready for a fun-filled evening under the sky! Join us for the Roses & Rosé Rooftop Part y where good vibes, tasty rosé, and beautiful people come together. It’s the perfect chance to chill, sip, and mingle in person with friends old and new. Singles and couples welcome. Enjoy specialty-themed cocktails (and mocktails) crafted with Villa Sandi Rosé Prosecco while dancing under the s",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Valentine's Day WALLCAST® Concert: Fire and Romance",
          "date": "2026-02-14",
          "time": "7:30PM",
          "location": "Miami Beach · Soundscape Park",
          "link": "https://www.eventbrite.com/e/valentines-day-wallcast-concert-fire-and-romance-tickets-1982354737383",
          "description": "Join New World Symphony for a romantic evening of music under the stars. This encore WALLCAST® Concert is swoon-worthy and free for all. Pack a picnic, bring a beach chair, and head to New World Symphony for a free WALLCAST® Concert. Thanks to a soaring, 7,000-square-foot-projection wall and surround sound speakers, you and your sweetheart will experience the power of orchestral music beneath the palm trees and bougainvillea. In this encore performance from the New World Symphony archives, Micha",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Valentine's Day Bridal Showcase at Rusty Pelican",
          "date": "2026-02-14",
          "time": "11:00AM",
          "location": "Key Biscayne · Rusty Pelican Miami Restaurant",
          "link": "https://www.eventbrite.com/e/valentines-day-bridal-showcase-at-rusty-pelican-tickets-1980752098848",
          "description": "Connect with the best event professionals in the industry, explore our stunning event spaces, and unlock incentives for your upcoming event! Fall head over heels for your dream event! Celebrate Valentine’s Day with an exclusive Bridal Showcase at Rusty Pelican Miami on Saturday, February 14th from 11AM–5PM . Discover our stunning waterfront venues, meet premier event professionals, and indulge in complimentary sips and bites while planning your perfect celebration. Attendance is complimentary, a",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "The Bossa Nova Experience",
          "date": "2026-02-14",
          "time": "7:00PM",
          "location": "Miami Beach · Euclid Oval",
          "link": "https://www.eventbrite.com/e/the-bossa-nova-experience-tickets-1977506655640",
          "description": "A night of bossa nova on Lincoln Road with The Bossa Nova Experience, featuring Latin GRAMMY winner Diogo Brown & vocalist Isa Duarte. The Bossa Nova Experience Let’s go to Rio de Janeiro with the tropical sounds of Sergio Mendes and Antonio Carlos Jobim! Enjoy songs like “Waters of March”, “Wave”, “The Girl from Ipanema” and other classics performed by The Bossa Nova Experience, a premier ensemble dedicated to this delightful genre adored around the world. Led by guitarist and Latin GRAMMY winn",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Annual Senior Valentine's Dance",
          "date": "2026-02-14",
          "time": "6:00PM",
          "location": "Miami · Joe Celestin Center",
          "link": "https://www.eventbrite.com/e/annual-senior-valentines-dance-tickets-1980583043198",
          "description": "Get ready to bust a move and share the love at our Annual Senior Valentine's Dance - it's going to be a night to remember! Get ready to bust a move and share the love at our Annual Senior Valentine's Dance - it's going to be a night to remember!",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Valentine's Day Rooftop Special",
          "date": "2026-02-14",
          "time": "6:00PM",
          "location": "Esmé Hotel Rooftop",
          "link": "https://dice.fm/event/g5mwq2-valentines-day-rooftop-special-14th-feb-esm-hotel-rooftop-miami-beach-tickets",
          "description": "Valentine’s Day on the rooftop at Esmé Hotel. Warm lights, smooth house music, crafted cocktails, and an intimate crowd under the Miami sky. Come celebrate love in all its forms—romantic, playful, or spontaneous—at one of the city’s most beautiful roofto... Read more This is an all ages event Presented by Modern Art Theory. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Low Key with Zulu & Friends",
          "date": "2026-02-14",
          "time": "10:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/wwro2p-low-key-with-zulu-friends-14th-feb-mode-miami-tickets",
          "description": "Low Key brings a night of deep grooves and global rhythms to MODE. Zulu leads the night with his signature afro-melodic sound, weaving a journey built for dancers and dreamers. He’s joined by Eri Bermeo, Ru, Tatiani, and Lui Danzi who each offer their own... Read more This is an 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue MODE 2 S Miami A",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "FREE| Swipe Right on a New Plant: Vizcaya Village Valentine’s Plant Swap",
          "date": "2026-02-15",
          "time": "10:00AM",
          "location": "Miami · Vizcaya Village",
          "link": "https://www.eventbrite.com/e/free-swipe-right-on-a-new-plant-vizcaya-village-valentines-plant-swap-tickets-1976766238031",
          "description": "Join us for Vizcaya Village Farmers Market’s Valentine Plant Swap! Bring a healthy plant to trade, meet fellow plant lovers, and let love Celebrate sustainability and community at the Valentine’s Plant Swap at Vizcaya Village Farmers Market! This event invites plant lovers to share, trade, and connect while learning about propagation and growing practices. Whether you’re a seasoned gardener or just starting out, this is your chance to meet Vizcaya horticulture staff, volunteers, and fellow enthu",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Free Movies at The Yard | UP",
          "date": "2026-02-15",
          "time": "3:00PM",
          "location": "Doral · The Doral Yard",
          "link": "https://www.eventbrite.com/e/free-movies-at-the-yard-up-tickets-1981704711137",
          "description": "Join us for cinematic fun with Up—a perfect family Sunday with tons of fun, great food, and happy vibes! 🌈 An uplifting adventure for the whole family 🎈 🍿 Join us for a fun and heartwarming FREE movie experience featuring the beloved animated film Up, perfect for kids and adults alike! Bring your family, relax, and enjoy a Sunday plan made for sharing smiles, laughter, and quality time. Grab delicious bites from our culinary vendors, enjoy refreshing drinks, and settle in for a movie afternoon f",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Yoga Sound — Yoga and Sound Healing in Miami",
          "date": "2026-02-15",
          "time": "12:00 PM",
          "location": "Laura Hunter Glassbox Ironside",
          "link": "https://lu.ma/jfmenqxf",
          "description": "​ As requested we are so so so happy to announce we will be bringing Yoga Sound back in February just a perfect event for Valentine's weekend!🥰 ​ Not our usual sound healing session, we are bringing movement with a fun yoga flow. Moving our body and energy just before settling down into our Sound Bath giving us a beautiful sense of release, alignment and peace. ​ Join us for a noon of movement, connection, and deep relaxation — Let's bring our mind, body, and heart into balance! In celebration o",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Humans Alike Sundays",
          "date": "2026-02-15",
          "time": "12:00PM",
          "location": "1-800-Lucky",
          "link": "https://dice.fm/event/v3b9d7-humans-alike-sundays-15th-feb-1-800-lucky-miami-tickets",
          "description": "Longest running Sunday house music party in Miami This is a 21+ event. Humans Alike & AmpOne. No Covid-19 entry requirements $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue 1-800-Lucky 143 Northwest 23rd Street, Miami, Florida 33127, United States Open in maps Doors open 12:00 PM EST Promoter Sundays Follow Download the DICE app Discover the best nights out in your city,",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "DOMICILE X ENCORE INVITES ",
          "date": "2026-02-15",
          "time": "5:00PM",
          "location": "Domicile Miami",
          "link": "https://dice.fm/event/nv9vx9-domicile-x-encore-invites-15th-feb-domicile-miami-miami-tickets",
          "description": "To my secret love, I’ve been queening out and admiring you from afar, biting my tongue while you’ve been with that crazy b*tch. But Sunday February 15th, post Valentine’s Day, Encore returns. 12 DJs, 12 hours, a secret lineup, and way too many reasons to... Read more This is an 18+ event Presented by Domicile. Venue Domicile Miami 2900 Northwest 7th Avenue, Miami, Florida 33127, United States Open in maps Doors open 5:00 PM EST Promoter Domicile Follow Download the DICE app Discover the best nig",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "LUNAR NEW YEAR CELEBRATION",
          "date": "2026-02-17",
          "time": "5:30PM",
          "location": "Miami · Palm Court Plaza - Miami Design District",
          "link": "https://www.eventbrite.com/e/lunar-new-year-celebration-tickets-1981746084887",
          "description": "Join us in Palm Court to celebrate the Year of the Horse for the Lunar New Year! Join us in Palm Court to celebrate the Year of the Horse for the Lunar New Year! Lion dancers will start their performance in Palm Court and dance their way through the District, ending in Paradise Plaza. Join us in Palm Court to celebrate the Year of the Horse for the Lunar New Year! Join us in Palm Court to celebrate the Year of the Horse for the Lunar New Year! Lion dancers will start their performance in Palm Co",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Canasta Round Robin + Lunch",
          "date": "2026-02-17",
          "time": "12:00 PM",
          "location": "a'Riva",
          "link": "https://lu.ma/dmypmlbl",
          "description": "​ For Ladies who Lunch.  You’re invited to a beautiful afternoon of delicious lunch and lively Canasta at one of Miami’s most stylish spots. ​ Whether you’re a seasoned pro or totally new to the game, all levels are welcome PLUS no partner required!  Come for the cards, stay for the connection. ​ Street parking and valet available.",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Fort Lauderdale Tech Meetup “Blockchain Adoption: The Future Of Trust”",
          "date": "2026-02-17",
          "time": "6:00 PM",
          "location": "NSU Broward Center of Innovation",
          "link": "https://lu.ma/ftltechmeetup02",
          "description": "​ About the meetup: Since 2023 the Fort Lauderdale Tech Meetup hosts monthly gatherings for startup founders and tech leaders, welcoming 150 to 200 guests per event. We believe Fort Lauderdale should be an incredible place to build a company—and that starts with building a solid community. You can expect no egos, just genuine connection. If you're building something great, or want to support those who are — join us. The Agenda: 6:00 PM Networking — A private guest directory will be provided upon",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Walking With A Purpose:Amigos Meet x The Underline Walk Club",
          "date": "2026-02-18",
          "time": "6:30PM",
          "location": "Miami · Thyme Machine",
          "link": "https://www.eventbrite.com/e/walking-with-a-purposeamigos-meet-x-the-underline-walk-club-tickets-1980755170034",
          "description": "Join us for a purposeful walk with the Amigos Meet x The Underline Walk Club - let's stroll and chat about life! Walking With A Purpose: Amigos Meet x The Underline Walk Club Wednesday, February 18 | 6:30PM – 8:15 PM 🚶‍♀️ Walk begins at 7:00 PM Check-in begins at 6:30 PM. Come early to ease into the experience, avoid lines, and connect with others before we walk. WHAT TO EXPECT This is a great way to meet new people and like-minded individuals in a welcoming, low-pressure environment. Walking Wi",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Axatipe  [Lucas Birthday]",
          "date": "2026-02-18",
          "time": "10:00PM",
          "location": "Do Not Sit On The Furniture",
          "link": "https://dice.fm/event/k6a73p-axatipe-lucas-birthday-18th-feb-do-not-sit-on-the-furniture-miami-beach-tickets",
          "description": "Wednesday, February 18th Do Not Sit On The Furniture presents Axatipe [Lucas Birthday] Mori Jessy Nimni Dmeyer Matan We are now open from 10 pm to 5 am. Come enjoy our magical venue... Please note, table reservations are highly recommended.. Table... Read more This is a 21+ event. Presented by Do Not Sit On The Furniture. No Covid-19 entry requirements $ You can get a refund if: It’s within 48 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours o",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Managing Major Projects in 2026 Construction & Insurance Essentials",
          "date": "2026-02-19",
          "time": "5:30PM",
          "location": "Miami · 50 Biscayne Blvd",
          "link": "https://www.eventbrite.com/e/managing-major-projects-in-2026-construction-insurance-essentials-tickets-1980728573483",
          "description": "Focused insights on construction planning, insurance coverage, and risk mitigation for today’s condo environment. Focused insights on construction planning, insurance coverage, and risk mitigation for today’s condo environment.",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Enzo GD & R3NATA",
          "date": "2026-02-19",
          "time": "10:00PM",
          "location": "Do Not Sit On The Furniture",
          "link": "https://dice.fm/event/53ro5k-enzo-gd-r3nata-19th-feb-do-not-sit-on-the-furniture-miami-beach-tickets",
          "description": "Thursday, February 19th Do Not Sit On The Furniture presents ENZO GD R3NATA Wizmin Ricardito from 10 pm to 5 am. Come enjoy our magical venue... Please note, table reservations are highly recommended.. Table Reservations: Please call 5105515067 or vis... Read more This is a 21+ event. Presented by Do Not Sit On The Furniture. No Covid-19 entry requirements $ You can get a refund if: It’s within 48 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hou",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "SHLUMP",
          "date": "2026-02-19",
          "time": "10:00PM",
          "location": "Kemistry",
          "link": "https://dice.fm/event/rywpq5-shlump-19th-feb-kemistry-fort-lauderdale-tickets",
          "description": "SHLUMP is coming to Kemistry Nightclub for an unforgettable night. Get ready to come bond with us! For table reservations please email/text: VIP@kemistrynightclub.com (954) 297- 9255 This is an 18+ event Presented by Kemistry. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Lineup Shlump Follow Venue Kemistry 307 Southwest 2nd Street, Fort Lauderdale, Florida 33312, United Sta",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Mantra's 1 Year Anniversary w/ Markem & More",
          "date": "2026-02-20",
          "time": "10:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/6dnylq-mantras-1-year-anniversary-w-markem-more-20th-feb-mode-miami-tickets",
          "description": "One year in, Mantra has grown into a ritual. A space where music is felt as much as it is heard, and where the room moves with shared intention. On Friday, February 20th, MODE celebrates one year of Mantra with a special anniversary edition led by Hanna L... Read more This is an 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Lineup Markem Follow H",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Something Chill: 2 Year Anniversary",
          "date": "2026-02-20",
          "time": "10:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/mxl98w-something-chill-2-year-anniversary-20th-feb-mode-miami-tickets",
          "description": "Two years in, and Something Chill has become one of those nights you don’t plan around, it just happens. The one that starts easy, builds naturally, and somehow turns into the highlight of the week. For this anniversary edition, we’re celebrating everythi... Read more This is an 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue MODE 2 S Miami A",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Meet Romero Britto in Miami Beach | Art Reveal, Music & Drinks",
          "date": "2026-02-21",
          "time": "6:00PM",
          "location": "Miami Beach · ROMERO BRITTO Fine Art Gallery",
          "link": "https://www.eventbrite.com/e/meet-romero-britto-in-miami-beach-art-reveal-music-drinks-tickets-1980896781598",
          "description": "Join us Saturday, February 21 at the iconic Romero Britto Fine Art Gallery for an unforgettable celebration of color, creativity and art. Step into the vibrant world of Romero Britto at an exclusive fine art event in Miami Beach . Join us Saturday, February 21 from 6–8 PM at the iconic Romero Britto Fine Art Gallery for an unforgettable evening celebrating color, creativity, and contemporary art. This special event features brand-new artwork reveals , a live artist signing , a DJ-curated soundtr",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "41st Annual SOMI Art Fest",
          "date": "2026-02-21",
          "time": "10:00AM",
          "location": "Miami · SOMI Art Fest",
          "link": "https://www.eventbrite.com/e/41st-annual-somi-art-fest-tickets-1979670520819",
          "description": "The 41st Annual SOMI Art Fest returns to the heart of South Miami on February 21-22, 2026! Join our free, beloved SoMi tradition! Read more The 41st Annual SOMI Art Fest returns to the heart of South Miami on February 21-22, 2026! Join our free, beloved SoMi tradition! The Rotary Club of South Miami proudly presents the 41st Annual SOMI Art Fest on February 21-22, 2026! The SOMI Art Fest is back! A juried art festival featuring over 120 fine artists from Miami, the US, and Canada, delicious food",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Casa Nané's One Year Anniversary Celebration",
          "date": "2026-02-21",
          "time": "10:00AM",
          "location": "Miami · Casa Nané",
          "link": "https://www.eventbrite.com/e/casa-nanes-one-year-anniversary-celebration-tickets-1980739538279",
          "description": "Join us as we celebrate one year of Casa Nané with a festive, all-day brunch party in the heart of Brickell. We’re gathering the community that’s been with us from day one for an afternoon of great food, celebratory sips, beats by Ava Praschnik (@yumiami_) and a few sweet surprises, our way of saying gracias for an unforgettable first year in Miami. 🩷🥂 Event Details Date: February 21, 2026 Time: 10:00 AM – 2:00 PM Location: Casa Nané (1130 SW 2nd Ave.) Admission: Open to the public What to Expec",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Celebrating Dominican Independence",
          "date": "2026-02-21",
          "time": "5:00PM",
          "location": "Miami · Club Tipico Dominicano",
          "link": "https://www.eventbrite.com/e/celebrating-dominican-independence-tickets-1982143907786",
          "description": "Join us for a fun day celebrating Dominican Independence with music, food, and great vibes! Read more Join us for a fun day celebrating Dominican Independence with music, food, and great vibes!",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Original Label : Enjoy",
          "date": "2026-02-21",
          "time": "10:00PM",
          "location": "M2 Miami",
          "link": "https://dice.fm/event/oevydy-original-label-enjoy-21st-feb-m2-miami-miami-beach-tickets",
          "description": "ENJOY is not just a party — it’s a late-night escape into sound, movement, and connection. On Saturday, February 21, the M2 Back Room transforms into a playground for deep grooves, hypnotic rhythms, and seamless energy from open to close. A carefully cura... Read more This is a 21+ event Pitch Park $ You can get a refund if: This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Lineup ABUEKEV ERIC V GAMMO MADI MOON IVANNA AMAR JUSTIN & LEO SOG AAR",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Cielo ",
          "date": "2026-02-21",
          "time": "10:00PM",
          "location": "Lunasol",
          "link": "https://dice.fm/event/bb8vpo-cielo-21st-feb-lunasol-miami-tickets",
          "description": "Cielo presents an elevated night of music and celebration at Lunasol Lounge. DRESS TO IMPRESS Sound by: TEKKMAN TABEA JUST MIGUEL NIKEEEKS DBÄSCH 📍 Lunasol Lounge 🗓 Saturday, February 21 ⏰ 10PM – 3AM 📍 158 NW 24th St, Miami, FL NO COVER... Read more This is an 21+ event Presented by Pitch Park $ You can get a refund if: This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Lineup TEKKMAN TABEA JUST MIGUEL NIKEEEKS DBÄSCH Venue Lunasol 158 Northwes",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "International Mac by Explorer",
          "date": "2026-02-21",
          "time": "10:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/92ww3d-international-mac-by-explorer-21st-feb-mode-miami-tickets",
          "description": "Step into the heart of global beats with EXPLORER. An event series showcasing the world's most compelling musical talents. This time, we feature International Mac, a musical storyteller blending French underground grooves with Berlin's gritty techno energy... Read more This is a 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue MODE 2 S Miami A",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "An Evening with Sonia Fulford, Guardvin (Garvey) Missick & Neki Mohan",
          "date": "2026-02-22",
          "time": "7:00PM",
          "location": "Coral Gables · Books & Books",
          "link": "https://www.eventbrite.com/e/an-evening-with-sonia-fulford-guardvin-garvey-missick-neki-mohan-tickets-1980022974016",
          "description": "Dual-voiced memoir of betrayal, faith, forgiveness, and rebuilding love—offering hope and healing after devastation. Join us at Books & Books for a conversation celebrating Hope In The Ashes – When The World Pressed In, We Pulled Closer , a deeply personal, dual-voiced memoir by Sonia and Garvey Missick . With honesty and grace, the authors share their journey through betrayal, faith, forgiveness, and the long work of rebuilding love, offering readers a powerful testament to healing and hope aft",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Humans Alike Sundays",
          "date": "2026-02-22",
          "time": "12:00PM",
          "location": "1-800-Lucky",
          "link": "https://dice.fm/event/oenvdr-humans-alike-sundays-22nd-feb-1-800-lucky-miami-tickets",
          "description": "Longest running Sunday house music party in Miami This is a 21+ event. Humans Alike & AmpOne. No Covid-19 entry requirements $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue 1-800-Lucky 143 Northwest 23rd Street, Miami, Florida 33127, United States Open in maps Doors open 12:00 PM EST Promoter Sundays Follow Download the DICE app Discover the best nights out in your city,",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "BELLY",
          "date": "2026-02-22",
          "time": "2:00PM",
          "location": "Kemistry",
          "link": "https://dice.fm/event/92a8e9-belly-22nd-feb-kemistry-fort-lauderdale-tickets",
          "description": "BELLY is an all Classic 90's and early 2000's HipHop, R&B & Reggae Party. If you haven't made it to one yet, don't miss the next one! Music by Special Guest Scram Jones, DJ Six Millz, DJ Exes, DJ 300 INTL and J Daiz. For VIP Reservations text or call : (... Read more This is an 21+ event Presented by Kemistry. Venue Kemistry 307 Southwest 2nd Street, Fort Lauderdale, Florida 33312, United States Open in maps Follow Doors open 2:00 PM EST Download the DICE app Discover the best nights out in your",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Tech Connect: Startups, Investors, Professionals Networking Event Miami",
          "link": "https://www.meetup.com/miami-startup-pitch-and-networking-group/events/312137185/",
          "date": "2026-02-23",
          "time": "7:00PM",
          "location": "La Rosa Gastrobar",
          "description": "Networking event for startup founders, investors, and tech professionals; outcome: co-founder matching.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Black History Film Festival - Miami",
          "date": "2026-02-24",
          "time": "5:30PM",
          "location": "Miami · 6304 NW 14th Ave",
          "link": "https://www.eventbrite.com/e/black-history-film-festival-miami-tickets-1778790543399",
          "description": "Join us for the 2nd Annual Black History Film Festival in Miami in Liberty City as we showcase Black stories as part of a national network. The Black History Film Festival was created by Marvin Arrington Jr in Atlanta in 2008. The festival expanded to Washington, DC in 2015 hosted by Richard Campbell. In 2024, the Black History Film Festival expanded to Miami. We like to keep in local as part of the City's revitalization program and host the screenings in Liberty City. More information to come. ",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "How to Design with AI - Meta & UKG",
          "date": "2026-02-24",
          "time": "6:00 PM",
          "location": "NSU Broward Center of Innovation",
          "link": "https://lu.ma/hs7a27co",
          "description": "​ ​How to Design with AI — Meta & UKG ​ ​AI is changing how we design. This is a high-energy, interactive AI & UX workshop with live demos, hands-on exercises, and a Q&A you can steer in real time. ​ Meet designers, product folks, and AI-curious builders—then leave with practical ways to bring AI into your design workflow (starting tomorrow). ​ ​Speakers ​ ​ Agnel Nieves Fuentes — Sr UI & UX Designer, UKG ​ ​ Daniel Rodriguez — Senior Product Designer, AI, Meta ​ ​Date & Time ​ ​⏰ Feb 24, 2026 |",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Women Building With AI: A Live Podcast Event",
          "date": "2026-02-24",
          "time": "6:00 PM",
          "location": "Location TBA",
          "link": "https://lu.ma/8fkrjm2r",
          "description": "​ Venture Week Miami is taking over the city with events for tech founders, investors, executives, marketers, and builders on the cutting edge of what’s next. ​ This special live event at Mindspace Wynwood is for those who want the real behind-the-scenes of how women are actually using AI to build meaningful companies faster, with more leverage and more freedom. ​ You’ll hear from Florida female founders building in the wellness, digital health, and AI-powered transformation space, plus a third ",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Why They Didn’t Invest",
          "date": "2026-02-24",
          "time": "6:30 PM",
          "location": "Mana Tech Loft 10",
          "link": "https://lu.ma/l50hnkko",
          "description": "​ Most founders never hear the real reason an investor passed. ​ The feedback is vague. The follow-up goes quiet. And founders are left guessing whether it was the pitch, the numbers, the market or something they didn’t even realize they were signaling. ​ This Ugly Talk pulls back the curtain on investor “no’s.” Not the polite ones, but the real ones: flawed data rooms, misaligned narratives, weak fundamentals, and timing mistakes that quietly kill deals. We’ll also examine the deals investors r",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Class of 2026 Senior Pinning Ceremony",
          "date": "2026-02-25",
          "time": "7:00PM",
          "location": "Miami · Christopher Columbus High School",
          "link": "https://www.eventbrite.com/e/class-of-2026-senior-pinning-ceremony-tickets-1979900958063",
          "description": "We are thrilled to hold the 4th Annual Senior Pinning Ceremony! *Important: Seniors and their pinning sponsors do not need to RSVP to this event on this page. This page is just for guests attending. Thank you. All members of the senior class are encouraged to participate in the 4th Annual Senior Pinning Ceremony on February 25th. Seniors will attend a dress rehearsal during the school day prior to the event to become familiar with the ceremony’s layout and format. Each senior must select a pinni",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "FIU Annual Interfaith Iftar Dinner",
          "date": "2026-02-25",
          "time": "5:00PM",
          "location": "Miami · Florida International University",
          "link": "https://www.eventbrite.com/e/fiu-annual-interfaith-iftar-dinner-tickets-1980664877968",
          "description": "Join the Jaffer Center for Muslim World Studies at FIU as we hold our Annual interfaith Iftar dinner in observance of Ramadan. Join the Jaffer Center for Muslim World Studies at FIU as we hold our Annual interfaith Iftar dinner in observance of Ramadan. The holy month of Ramadan is observed by Muslims worldwide. According to Islamic belief, it commemorates the first revelation of the Quran from Allah (God) to the Prophet Muhammad, through the angel Gabriel. This interfaith Iftar dinner is a comm",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Brickell Investors & Entrepreneurs Networking Event - Rooftop Soirée",
          "date": "2026-02-25",
          "time": "7:00PM",
          "location": "Miami · Rosa Sky",
          "link": "https://www.eventbrite.com.au/e/brickell-investors-entrepreneurs-networking-event-rooftop-soiree-tickets-1981892714460",
          "description": "Come mingle and make connections while enjoying a beautiful evening of cocktails and sunset views! Come mingle and make connections while enjoying a beautiful evening of cocktails and sunset views. This is your chance to discuss entrepreneurship, explore investing opportunities, and share startup ideas with our incredible community. Let’s learn from each other and uncover the next big business opportunity together! To keep the atmosphere professional yet comfortable, please dress in business cas",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Brickell Investors & Entrepreneurs Networking Event🍸Rooftop Soirée",
          "link": "https://www.meetup.com/brickell-investors-entrepreneurs/events/313102293/",
          "date": "2026-02-25",
          "time": "7:00PM",
          "location": "Rosa Sky Rooftop",
          "description": "In-person networking event for investors and entrepreneurs to connect, discuss startups and investing, and identify investment or collaboration opportunities.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Hard Tech War Room: Battle Stories and Game Planning for your product.",
          "date": "2026-02-25",
          "time": "6:00 PM",
          "location": "Location TBA",
          "link": "https://lu.ma/by1tdnwy",
          "description": "​ Join us in the trenches of building the product. ​ Learn the design philosophy of translating messy user needs into solid design inputs, hear from startups that survived the battle, and bring out your own technical issues to combat. ​ This is a technical session for founders, builders, and those with great ideas they want to bring to life. ​ Join HardTech Miami and leave with a framework to bring your product to life. ​ Keynote: Design Philosophy ​ An overview of the methodology of designing a",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Miami AI Hub - Generative Gatherings with Amazon",
          "date": "2026-02-25",
          "time": "6:00 PM",
          "location": "2750 NW 3rd Ave",
          "link": "https://lu.ma/ibgfb69p",
          "description": "​ Generative Gathering February with Amazon ​ The program features: ​ Keynote Speaker from Amazon Dhiraj Mahapatro - Principal Specialist Solutions Architect - Amazon Bedrock at Amazon Web Services (AWS) ​ 2 Startup Showcases after the keynote speaker ​ Networking Reception ​ Generative Gatherings are designed to educate, inspire, and build community. Expect thought-provoking content, practical applications, and a chance to connect with leaders shaping the future through AI. About Miami AI Hub ​",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Rooftop Movie Night @ S4x26",
          "date": "2026-02-25",
          "time": "6:30 PM",
          "location": "Location TBA",
          "link": "https://lu.ma/g9t4yahy",
          "description": "​ Movie night is back for 2026! Join us for another rooftop movie night with great views of South Beach! You'll have the opportunity to network with your ICS cyber industry peers, catch a film, and enjoy great food and beverages. There may even be some great giveaways! ​ Family members are welcome. Spaces are limited, so reserve your ticket now! ​ Thanks to our sponsors: ​ Aspiron Search: www.aspironsearch.com ​ Garland Technology: www.garlandtechnology.com ​ Insane Cyber: www.insanecyber.com",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Sahar Z [Lost & Found]",
          "date": "2026-02-25",
          "time": "10:00PM",
          "location": "Do Not Sit On The Furniture",
          "link": "https://dice.fm/event/g5dvp5-sahar-z-lost-found-25th-feb-do-not-sit-on-the-furniture-miami-beach-tickets",
          "description": "Wednesday, February 24th Do Not Sit On The Furniture presents Sahar Z [Lost & Found] Jessy Nimni We are now open from 10 pm to 5 am. Come enjoy our magical venue... Please note, table reservations are highly recommended.. Table Reservations: Please ca... Read more This is a 21+ event. Presented by Do Not Sit On The Furniture. No Covid-19 entry requirements $ You can get a refund if: It’s within 48 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hou",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Havana Night",
          "date": "2026-02-26",
          "time": "6:30PM",
          "location": "Doral · Doral Cultural Arts Center",
          "link": "https://www.eventbrite.com/e/havana-night-tickets-1980279658767",
          "description": "Enjoy a free, vibrant Havana Night featuring live Cuban music, lively performances, and a soulful, island-inspired atmosphere! Get ready for Havana Night, a vibrant experience under the stars! Enjoy an unforgettable evening filled with lively Cuban rhythms, energetic performances, and timeless sounds that celebrate the soul of Havana. Let the infectious beats and rich musical traditions set the mood for a festive and magical night. Location: Doral Cultural Arts Center | 8363 NW 53rd Street Date ",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Miami Tech Mixer 2026",
          "link": "https://www.meetup.com/miamitech/events/312170892/",
          "date": "2026-02-26",
          "time": "6:00PM",
          "location": "Arlo Wynwood Miami",
          "description": "Paid in-person networking event for startup, tech, AI, and Web3 professionals to find their next client.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Miami Health Tech Meetup",
          "date": "2026-02-26",
          "time": "5:30 PM",
          "location": "Negroni Bistro & Sushi Bar",
          "link": "https://lu.ma/xhzd0nyk",
          "description": "​ A casual happy hour for folks working or interested in healthcare/health tech to hang out and get to know one another! Anyone is welcome to attend, but capacity is limited to ensure a positive experience for all attendees. This event is not sponsored. ​ In partnership with Health Tech Nerds . Their weekly newsletter and private Slack community are high-value resources that thousands rely on to stay informed and connected in healthcare/health tech. Learn more, subscribe, and join today.",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Vibey Hour®️: Miami - BHM Edition",
          "date": "2026-02-26",
          "time": "6:00 PM",
          "location": "Del Ro & Double A Management",
          "link": "https://lu.ma/pix9xih9",
          "description": "​ Vibey Hour®️: Miami - Black History Month Edition presented by Moet Hennessy ​ Vibey Hour®️ is BACK and returning to Miami! If you have attended a Vibey Hour in Atlanta, Chicago, D.C. or Miami in the past, you already know the Vibes! (Literally) ​ For newcomers, join us at Le Chick on February 26th, 2026 at  6 PM. Come enjoy complimentary Hennessy VS and Hennessy VSOP cocktails and delicious bites from Le Chick (while supplies last).",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Ostaad, Basilone, Kate Ochoa, Play-Joh",
          "date": "2026-02-26",
          "time": "10:00PM",
          "location": "Do Not Sit On The Furniture",
          "link": "https://dice.fm/event/avpbnq-ostaad-basilone-kate-ochoa-play-joh-26th-feb-do-not-sit-on-the-furniture-miami-beach-tickets",
          "description": "Thursday, February 26th Do Not Sit On The Furniture presents Ostaad Basilone Kate Ochoa Play-Joh from 10 pm to 5 am. Come enjoy our magical venue... Please note, table reservations are highly recommended.. Table Reservations: Please call 5105515067 or... Read more This is a 21+ event. Presented by Do Not Sit On The Furniture. No Covid-19 entry requirements $ You can get a refund if: It’s within 48 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hou",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Ryan Shepheard by Higher Viiibrations",
          "date": "2026-02-26",
          "time": "11:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/oegmkg-ryan-shepheard-by-higher-viiibrations-26th-feb-mode-miami-tickets",
          "description": "Higher Viiibrations returns to MODE with a night built for movement, momentum, and high-energy connection on the dance floor. This edition welcomes Ryan Shepherd, a globally recognized producer and performer whose sound bridges polished house grooves with... Read more This is an 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Lineup Ryan Shepherd F",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "Caribbean Contrasts at the Koubek Center",
          "date": "2026-02-27",
          "time": "6:00PM",
          "location": "Miami · 2705 SW 3rd St",
          "link": "https://www.eventbrite.com/e/caribbean-contrasts-at-the-koubek-center-tickets-1981080295493",
          "description": "Join us for an immersive evening celebrating architecture, art, music, film, dance, literature, and community. Join Miami Dade College’s Koubek Center, Miami Book Fair, Miami Film Festival, Museum of Art and Design, and Live Arts Miami for an immersive evening celebrating Open House Miami and highlighting architecture, art, music, film, dance, literature, and community. This FREE Caribbean Contrasts event during Open House Miami exemplifies this legacy, offering an opportunity for the community ",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Jazz at MOCA | Exhibition Viewing",
          "date": "2026-02-27",
          "time": "7:00PM",
          "location": "North Miami · Museum of Contemporary Art North Miami",
          "link": "https://www.eventbrite.com/e/jazz-at-moca-exhibition-viewing-tickets-1981506813219",
          "description": "MOCA presents Jazz at MOCA - a wonderful, neighborhood experience to take in world class art and sound. On the last Friday of the month, MOCA presents Jazz at MOCA - a wonderful, neighborhood experience to take in world-class art and sound. Every last Friday of the month, for over two decades, Jazz at MOCA has merged art and jazz, becoming an integral part of the North Miami community and Miami's music scene. The ticket includes free admission to the museum. Read more MOCA presents Jazz at MOCA ",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Live Karaoke Miami Language Exchange Party! 🎤🎶 (In Brickell)",
          "link": "https://www.meetup.com/miami-language-exchange-parties/events/313122224/",
          "date": "2026-02-27",
          "time": "6:30PM",
          "location": "Batch Gastropub: Miami",
          "description": "An in-person live karaoke language-exchange party for language learners; outcome: practice languages with strangers and perform a song on stage.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Claude Code Meetup Miami",
          "date": "2026-02-27",
          "time": "6:30 PM",
          "location": "Waitlist",
          "link": "https://lu.ma/a1gwb2ei",
          "description": "​ Join a Claude Code Community Event, organized by local Claude Code enthusiasts for everyone who loves building with Claude Code! ​ Claude Code Miami x Venture Miami Week ​ 6:30 PM — Doors Open & Networking Grab a drink and refreshments connect with fellow builders, and meet the WRTH and Anthropic teams. ​ 7:00 PM — Welcome & Opening Remarks Introduction from WRTH Founder & CTO Justin Elliott on building Miami’s AI ecosystem, and remarks from Anthropic on their mission to empower the next gener",
          "source": "Luma",
          "city": "fl--miami"
        },
        {
          "title": "Grooveland by Silvio Rodrigues",
          "date": "2026-02-27",
          "time": "9:00PM",
          "location": "MODE",
          "link": "https://dice.fm/event/92ae5n-grooveland-by-silvio-rodrigues-27th-feb-mode-miami-tickets",
          "description": "Step into the rhythm of the underground. A night of curated electronic sounds, elevated vibes, and a crowd that lives for the music. Join us for another amazing edition of GROOVELAND where energy, connection, and sound collide in the heart of Miami. This is an 21+ event Presented by MODE. $ You can get a refund if: It’s within 24 hours of buying tickets This event is rescheduled or cancelled You can't get a refund within 24 hours of the event start time. Venue MODE 2 S Miami Ave, Miami, Florida ",
          "source": "Dice.fm",
          "city": "fl--miami"
        },
        {
          "title": "26th Annual No More Broken Hearts Domestic Violence Event",
          "date": "2026-02-28",
          "time": "9:00AM",
          "location": "Miami · Miami Dade College - North Campus, Northwest 27th Avenue, Miami, FL, USA",
          "link": "https://www.eventbrite.com/e/26th-annual-no-more-broken-hearts-domestic-violence-event-tickets-1822656317109",
          "description": "Join us at R.I.S.E. - Resilience Inspires Strength and Empowerment DV Event to be inspired, empowered, and find your inner strength! Welcome to the R.I.S.E. - Resilience Inspires Strength and Empowerment DV Event ! Join us at Miami Dade College - North Campus for a day filled with inspiration, empowerment, and support. This event aims to uplift individuals impacted by domestic violence, offering a safe space to share stories, gain strength, and build resilience. Together, we can overcome challen",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "The Spasticity and Movement Disorders IMPACT Initiative - Miami",
          "date": "2026-02-28",
          "time": "7:30AM",
          "location": "Miami · Miami Marriott Biscayne Bay",
          "link": "https://www.eventbrite.com/e/the-spasticity-and-movement-disorders-impact-initiative-miami-tickets-1979988677434",
          "description": "Join us for a complimentary hands on CME/CE workshop! Saturday, February 28, 2026 – Miami Marriott Biscayne Bay - 7:30 AM-4:30 PM Read more Join us for a complimentary hands on CME/CE workshop! Saturday, February 28, 2026 – Miami Marriott Biscayne Bay - 7:30 AM-4:30 PM Who should attend The initiative is intended for neurologists, physiatrists, orthopedic surgeons, nurse practitioners, physician assistants, and physical and occupational therapists. Program Overview Improve your ability to identi",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Historic Lyric Theater Unlocked: Open House Miami",
          "date": "2026-03-01",
          "time": "1:30PM",
          "location": "Miami · Black Archives - Historic Lyric Theater",
          "link": "https://www.eventbrite.com/e/historic-lyric-theater-unlocked-open-house-miami-tickets-1981523640550",
          "description": "Experience the soul of Miami at the Historic Lyric Theater Unlocked event during Open House Miami! Begin your evening with an exclusive guided tour of the iconic Lyric Theater and the Black Archives, uncovering the rich stories and cultural legacy of Overtown. Then, immerse yourself in a dynamic 90-minute multidisciplinary performance by Art Prevails Project—featuring live music, song, poetry, dramatic performances, and interactive moments that bring history and creativity to life. Don’t miss th",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "A Conversation with Victor Deupi: Rada Photography",
          "date": "2026-03-01",
          "time": "6:00PM",
          "location": "Coral Gables · Books & Books",
          "link": "https://www.eventbrite.com/e/a-conversation-with-victor-deupi-rada-photography-tickets-1981497824333",
          "description": "Meet author Victor Deupi at Books & Books for a conversation and Q&A about his book Rada Photography. Join us at Books & Books for an engaging Conversation + Q&A with architectural historian Victor Deupi, as he discusses his forthcoming book Rada Photography: Mid-Century Architecture and Culture in South Florida and the Caribbean. In this first critical biography of photographers Annette and Rudi Rada, Deupi highlights how their work captured the rise of Tropical Modern architecture and the dyna",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "South Florida Quince Expo",
          "date": "2026-03-07",
          "time": "11:00AM",
          "location": "Hialeah Gardens · Holiday Inn Miami West - Airport Area, an IHG Hotel",
          "link": "https://www.eventbrite.com/e/south-florida-quince-expo-tickets-1588185197679",
          "description": "Join us at the Holiday Inn West for fun, fabulous food and beautiful fashion and fantastically talented professionals! Join us at the Holiday Inn West for fun, fabulous food and beautiful fashion and fantastically talented professionals!",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "Miami Online Speed Dating for introverts",
          "link": "https://www.meetup.com/silenttide-velvet-pulse-collective/events/313144095/",
          "date": "2026-03-07",
          "time": "4:00PM",
          "location": "Mast Academy",
          "description": "Online speed dating for introverts: meet like-minded singles from home and form genuine connections.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Miami Speed Dating - Valentines Edition",
          "link": "https://www.meetup.com/wholeheart-valentines-group/events/313109719/",
          "date": "2026-03-07",
          "time": "4:00PM",
          "location": "4620 NW 7th St",
          "description": "Online speed-dating for introverted singles seeking meaningful dialogue; designed for shy professionals to connect with compatible matches in 5-minute rounds.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "Artificial intelligence, ML, DeepTech: Business & Startups Networking Mixer ",
          "link": "https://www.meetup.com/miami-startup-pitch-and-networking-group/events/312538361/",
          "date": "2026-03-09",
          "time": "7:00PM",
          "location": "Red Phone Booth - Miami",
          "description": "Networking mixer for AI/ML/DeepTech entrepreneurs, investors, and professionals; attendees deliver 1-min pitches to peers to connect with investors for funding.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "33rd Annual JohnMartin's St. Patrick's Street Festival",
          "date": "2026-03-14",
          "time": "2:00PM",
          "location": "Coral Gables · John Martin's Irish Pub & Restaurant",
          "link": "https://www.eventbrite.com/e/33rd-annual-johnmartins-st-patricks-street-festival-tickets-1980673125637",
          "description": "Sat, March 14, join us for the 33rd Annual JohnMartin's St. Patrick's Street Festival ft. Live Bands, Entertainment, Drinks, Food + More! Miami's biggest St. Patrick's Day festival returns to Coral Gables! Saturday, March 14th, come indulge in some good ol’ IRISH fun & celebrate the 33RD Annual JohnMartin's St. Patrick's Day Street Festival with us! Starting at 2:00 PM until Midnight on the streets of Coral Gables, enjoy Live Bands , Entertainment , Bar Stations , Food , Games & more! Event Deta",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "S.H.E. Gives Back",
          "date": "2026-03-21",
          "time": "1:30PM",
          "location": "Miami · The Westchester Cultural Arts Center",
          "link": "https://www.eventbrite.com/e/she-gives-back-tickets-1981436885062",
          "description": "S.H.E. Gives Back brings women together through style and purpose. Shop with intention and support St. Jude Children’s Research Hospital. S.H.E. Gives Back, presented by Jenisbel Acevedo & Friends, is a purpose-driven shopping experience designed to unite fashion lovers, women of impact, and our community. On March 21st at the Westchester Cultural Arts Center , enjoy a day filled with style, heart, and empowerment, featuring curated luxury and exclusive designer pieces. A portion of proceeds wil",
          "source": "Eventbrite",
          "city": "fl--miami"
        },
        {
          "title": "LOCAL ART CLUB | Art Social Saturday",
          "link": "https://www.meetup.com/midtown-miami-social-art-fashion-music/events/312534373/",
          "date": "2026-12-22",
          "time": "12:18AM",
          "location": "Arlo Wynwood Hotel",
          "description": "Live art and fashion social for local artists and vendors blending visuals, design and house music; attendees discover new artists and shop handmade pieces.",
          "source": "Meetup",
          "city": "fl--miami"
        },
        {
          "title": "From Self-Abandonment to Self-Trust",
          "link": "https://www.meetup.com/connected-secure-womens-self-trust-healthy-connections/events/313025848/",
          "date": "2027-02-09",
          "time": "5:00PM",
          "location": "Link visible for attendees",
          "description": "Workshop for anyone seeking personal growth and attachment healing, open to all levels, offering practical steps to begin rebuilding self-trust and inner safety.",
          "source": "Meetup",
          "city": "fl--miami"
        }
      ],
      "total": 95,
      "last_updated": "2026-02-09T08:04:18.849197",
      "sources": {
        "Eventbrite": 40,
        "Meetup": 12,
        "Luma": 19,
        "Dice.fm": 24,
        "RA.co": 0
      }
    }
  },
  "last_updated": "2026-02-09T08:04:18.849134"
}